<a href="https://colab.research.google.com/github/lavanyapunnapuneeru/6_student-management-system/blob/master/Unit_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
arr = np.arange(10)
arr

In [ ]:
np.save('file',arr)

In [ ]:
np.load('file.npy')

In [ ]:
import pandas as pd
obj = pd.Series([4, 7, -5, 3])
obj

In [ ]:
obj.values

In [ ]:
obj.index

In [ ]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

In [ ]:
obj2[['a','d','c']]

In [ ]:
obj2.index

In [ ]:
obj2[obj2 > 0]

In [ ]:
obj2*2

In [ ]:
np.exp(obj2)

In [ ]:
data={1:'aaa',2:'bbb',3:'ccc'}
data

In [ ]:
'e' in obj2

In [ ]:
 sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [ ]:
sdata

In [ ]:
obj3=pd.Series(sdata)

In [ ]:
obj3

In [ ]:
 states = ['California', 'Ohio', 'Oregon', 'Texas']

In [ ]:
states

In [ ]:
 obj4 = pd.Series(sdata, index=states)
 obj4

In [ ]:
pd.notnull(obj4)

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'population'

In [ ]:
obj4.index.name = 'state'

In [ ]:
obj4

In [ ]:
obj

In [ ]:
obj

# DataFrame

*A DataFrame represents a tabular, spreadsheet-like data structure containing an odered collection of columns ( different value type)*

 * The DataFrame has both a row and column index.
 * It can be thought of as a dict of Series.
 
## Constructing a DataFramefrom a dict of equal-length lists or NumPy arrays

In [ ]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [ ]:
frame = pd.DataFrame(data)

In [ ]:
frame

DataFrame will have its index assigned automatically

Specify a sequence of columns in the DataFrame’s

In [ ]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

Pass a column that isn’t contained in data

In [ ]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [ ]:
frame2

### Access Columns in DataFrame

In [ ]:
frame2.columns

A column in a DataFrame can be retrieved by dict-like notation:

In [ ]:
frame2['pop']

A column in a DataFrame can be retrieved by attribute:

In [ ]:
frame2.state

Rows can also be retrieved by position or name such as the ix indexing field

In [ ]:
 frame2.ix['three']

In [ ]:
frame2.loc['three']

Columns can be modified by assignment: Column could be assigned a scalar value or an array of values

In [ ]:
frame2['debt'] = 12
frame2

In [ ]:
import numpy as np

frame2['debt'] = np.arange(5)
frame2

Assigning a column that doesn’t exist will create a new column.

In [ ]:
frame2['western'] = ['22','33','c','d','e']
frame2

In [ ]:
frame2

Delete a Column

In [ ]:

del frame2['debt']

frame2.columns

Another Common form of data is a nested dict of dicts format:

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If passed to DataFrame, it will interpret the **Outer dict keys as the columns and the Inner keys as the row indices:**

In [ ]:
frame3 = pd.DataFrame(pop)

frame3

Tranpose of a DataFrame

In [ ]:
frame3.T

#### DataFrame’s index and columns have their name attributes set ####

In [ ]:
frame3.index.name = 'year';

frame3.columns.name = 'state'

frame3

***Value Attribute of DataFrame :***

In [ ]:
frame3.values

In [ ]:
frame2.values

###  Possible data inputs to DataFrame constructor ###

    Type                                             Notes 

2D ndarray                          A matrix of data, passing optional row and column labels

dict of arrays, lists, or tuples    Each sequence becomes a column in the DataFrame. All sequences must be the same length.
NumPy structured/record array       Treated as the “dict of arrays” case

dict of Series                      Each value becomes a column. Indexes from each Series are unioned together to form the
                                    result’s row index if no explicit index is passed.
                                    
dict of dicts                       Each inner dict becomes a column. Keys are unioned to form the row index as in the “dict of
                                    Series” case.
                                    
list of dicts or Series             Each item becomes a row in the DataFrame. Union of dict keys or Series indexes become the
                                    DataFrame’s column labels
                                    
List of lists or tuples             Treated as the “2D ndarray” case

Another DataFrame                   The DataFrame’s indexes are used unless different ones are passed

NumPy MaskedArray                   Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result

## Index Objects ##

* Pandas’s Index objects are responsible for holding the axis labels and other metadata (like the axis name or names).


* Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index.

In [ ]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index

In [ ]:
index[1:]

In [ ]:
obj

***Index objects are immutable and thus can’t be modified by the user:***

In [ ]:
index[2] = 'e'

Immutability is important so that Index objects can be safely shared among data
structures:

### Main Index objects in pandas ###

Class            Description

Index          The most general Index object, representing axis labels in a NumPy array of Python objects.
Int64Index     Specialized Index for integer values.
MultiIndex     “Hierarchical” index object representing multiple levels of indexing on a single axis. Can be thought of
                as similar to an array of tuples.
DatetimeIndex  Stores nanosecond timestamps (represented using NumPy’s datetime64 dtype).
PeriodIndex    Specialized Index for Period data (timespans).

### Index methods and properties ###

Method                      Description

append         Concatenate with additional Index objects, producing a new Index
diff           Compute set difference as an Index
intersection   Compute set intersection
union          Compute set union
isin           Compute boolean array indicating whether each value is contained in the passed collection
delete         Compute new Index with element at index i deleted
drop           Compute new index by deleting passed values
insert         Compute new Index by inserting element at index i
is_monotonic   Returns True if each element is greater than or equal to the previous element
is_unique      Returns True if the Index has no duplicate values
unique         Compute the array of unique values in the Index

### Reindexing ###

Create a new object with the data conformed to a new index.

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

Calling reindex on this Series rearranges the data according to the new index.

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2


Introduces missing values if any index values were not already present:

#### Filling of values when reindexing

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=5)

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

The method option 'ffill' forward fills the values.

In [ ]:
obj3.reindex(range(6), method='ffill')

#### reindex method (interpolation) options

Argument                   Description

ffill or pad         Fill (or carry) values forward
bfill or backfill    Fill (or carry) values backward

With DataFrame, reindex can alter either the (row) index, columns, or both.

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

The columns can be reindexed using the columns keyword:

In [ ]:
states = ['Texas', 'Utah', 'California']

frame.reindex(columns=states)

Rows and Columns can be reindexed at a time, though interpolation will only apply row-wise (axis 0):

In [ ]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states.sort())

#### reindex function arguments

Argument              Description

index         New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An
Index         will be used exactly as is without any copying
method        Interpolation (fill) method, see Table 5-4 for options.
fill_value    Substitute value to use when introducing missing data by reindexing
limit         When forward- or backfilling, maximum size gap to fill
level         Match simple Index on level of MultiIndex, otherwise select subset of
copy          Do not copy underlying data if new index is equivalent to old index. True by default (i.e. always copy data).

### Dropping entries from an axis

The drop method will return a new object with the indicated value or values deleted from an axis:

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
new_obj = obj.drop('a')

new_obj

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

Index values can be deleted from either axis in  DataFrame

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
 data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing and selection into a DataFrame

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence:

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [ ]:
data[['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [ ]:
data[2:4]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [ ]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.loc['Utah', ['three']]

three    10
Name: Utah, dtype: int32

#### Indexing options with DataFrame

Type                            Notes

obj[val]              Select single column or sequence of columns from the DataFrame. Special case conveniences: boolean array                        (filter rows), slice (slice rows), or boolean DataFrame (set values based on some criterion).
obj.ix[val]           Selects single row of subset of rows from the DataFrame.
obj.ix[:, val]        Selects single column of subset of columns.
obj.ix[val1, val2]    Select both rows and columns.
reindex method        Conform one or more axes to new indexes.
xs method             Select single row or column as a Series by label.
icol, irow methods    Select single column or row, respectively, as a Series by integer location.
get_value, set_value methods        Select single value by row and column label.

### Arithmetic and data alignment

Arithmetic between objects with different indexes.

When adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [ ]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces NA values in the indices that don’t overlap.

Missing values propagate in arithmetic computations.

In [ ]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [ ]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
df1 * df2

             b   c     d   e
Colorado   NaN NaN   NaN NaN
Ohio       0.0 NaN   8.0 NaN
Oregon     NaN NaN   NaN NaN
Texas     18.0 NaN  35.0 NaN
Utah       NaN NaN   NaN NaN

Adding these together returns a DataFrame whose index and columns are the unions
of the ones in each DataFrame

#### Flexible arithmetic methods

Method        Description

add        Method for addition (+)
sub        Method for subtraction (-)
div        Method for division (/)
mul        Method for multiplication (*)

### Sorting

#### Index Based Sorting

In [ ]:
import pandas as pd
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [ ]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [ ]:
import numpy as np
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

Row Index based sorting

In [ ]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

Column Index based sorting

In [ ]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

#### Values based Sorting

In [ ]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [ ]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [ ]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [ ]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [ ]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [ ]:
frame.sort_values(by =['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Ranking

In [ ]:
import pandas as pd
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [ ]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

By default rank() assigns each group the mean rank:

Ranks can also be assigned according to the order they’re observed in the data:

In [ ]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [ ]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

rank in descending order

In [ ]:
obj.rank(ascending=True, method='average')

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [ ]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

DataFrame can compute ranks over the rows or the columns:

In [ ]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [ ]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

##### Tie-breaking methods with rank

Method             Description
'average'   Default: assign the average rank to each entry in the equal group.
'min'       Use the minimum rank for the whole group.
'max'       Use the maximum rank for the whole group.
'first'     Assign ranks in the order the values appear in the data.

### Summarizing and Computing Descriptive Statistics

Pandas objects are equipped with a set of common mathematical and statistical methods

In [ ]:
import numpy as np
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [ ]:
df.sum()

one    9.25
two   -5.80
dtype: float64

#### Passing axis=1 sums over the rows instead:

In [ ]:
 df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [ ]:
 df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

##### Descriptive and summary statistics

Method                 Description

count             Number of non-NA values
describe          Compute set of summary statistics for Series or each DataFrame column
min, max          Compute minimum and maximum values
argmin, argmax    Compute index locations (integers) at which minimum or maximum value obtained, respectively
idxmin, idxmax    Compute index values at which minimum or maximum value obtained, respectively
quantile          Compute sample quantile ranging from 0 to 1
sum               Sum of values
mean              Mean of values
median            Arithmetic median (50% quantile) of values
mad               Mean absolute deviation from mean value
var               Sample variance of values
std               Sample standard deviation of values
skew              Sample skewness (3rd moment) of values
kurt              Sample kurtosis (4th moment) of values
cumsum            Cumulative sum of values
cummin, cummax    Cumulative minimum or maximum of values, respectively
cumprod           Cumulative product of values
diff              Compute 1st arithmetic difference (useful for time series)
pct_change        Compute percent changes

### Hierarchical Indexing

Hierarchical indexing enables you to have multiple (two or more) index levels on an axis.

In [ ]:
data = pd.Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 1, 2]])
data

a  1    0.669858
   2    1.246403
   3   -0.082477
b  1    0.065737
   2    0.636394
   3    0.653113
c  1   -0.033943
   2    1.536065
d  1   -0.166109
   2   -1.310859
dtype: float64

The “gaps” in the index display mean “use the label directly above”:

In [ ]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 1),
            ('d', 2)],
           )

In [ ]:
 data['a']

1    0.669858
2    1.246403
3   -0.082477
dtype: float64

partial indexing

In [ ]:
data['b':'c']

b  1   -0.093439
   2   -0.209848
   3   -2.127310
c  1    1.460452
   2    1.413381
dtype: float64

 Data could be rearranged into a DataFrame using its unstack method:

In [ ]:
data.unstack()

          1         2         3
a  0.669858  1.246403 -0.082477
b  0.065737  0.636394  0.653113
c -0.033943  1.536065       NaN
d -0.166109 -1.310859       NaN

In [ ]:
data.unstack().stack()

a  1   -1.445927
   2   -0.839161
   3   -1.515594
b  1   -0.093439
   2   -0.209848
   3   -2.127310
c  1    1.460452
   2    1.413381
d  2    0.677317
   3   -0.172199
dtype: float64

The inverse operation of unstack is stack: